app/controllers/requests_controller.rb

INSERT INTO "requests" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["team_id", 2], ["created_at", 2017-02-22 21:36:23 UTC], ["updated_at", 2017-02-22 21:36:23 UTC]]
---
  def create
    @request = current_user.requests.new(request_params)

    if @request.save