app/controllers/teams_controller.rb

  def create
    @team = current_user.teams.new(team_params)

    if @team.save
---
INSERT INTO "teams" ("name", "vacant_spots", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "new team"], ["vacant_spots", 4], ["status", "active"], ["user_id", 1], ["created_at", 2017-02-22 21:17:07 UTC], ["updated_at", 2017-02-22 21:17:07 UTC]]